# Hello world

Basic pandas hacking based on [10 minutes to pandas](http://pandas.pydata.org/pandas-docs/version/0.24/getting_started/10min.html) docs article

## Imports
Pandas works on the top of numpy - and can also work with numpy so it is useful to import also numpy

In [1]:
import numpy as np
import pandas as pd

## Data series
DataSeries in 1d data structure (list of scalars)

In [2]:
s = pd.Series([1,2,3,4,5])
s

0    1
1    2
2    3
3    4
4    5
dtype: int64

Date range (6 days) as a Series

In [3]:
s_date_range = pd.date_range('20180328', periods=6)
s_date_range

DatetimeIndex(['2018-03-28', '2018-03-29', '2018-03-30', '2018-03-31',
               '2018-04-01', '2018-04-02'],
              dtype='datetime64[ns]', freq='D')

## Data Frame
DataFrame is 2d data structure (list of data series)

In [4]:
df = pd.DataFrame(np.random.rand(5,5))
df

          0         1         2         3         4
0  0.668371  0.248403  0.503253  0.875036  0.213453
1  0.587960  0.725513  0.358628  0.278155  0.492740
2  0.589898  0.530116  0.086756  0.146980  0.776433
3  0.872986  0.253404  0.912884  0.615280  0.509719
4  0.221691  0.952627  0.633094  0.006103  0.057016

## Column headers
Headers can be added to DataFrame by using `columns` parameter or by passing a map instead of list during creation of DataFrame

using `coulumns` parameter

In [5]:
df_with_headers = pd.DataFrame(
    np.random.rand(5,5), 
    columns = ['First', 'Second', 'Third', 'Fourth', 'Fifth']
)

df_with_headers

      First    Second     Third    Fourth     Fifth
0  0.154815  0.076610  0.364789  0.686079  0.411141
1  0.462158  0.106688  0.171936  0.394472  0.268592
2  0.183771  0.026125  0.137451  0.900385  0.819643
3  0.301644  0.977870  0.048293  0.442445  0.024020
4  0.672373  0.657830  0.641988  0.492114  0.645047

Passing map:

In [6]:
df_with_headers_2 = pd.DataFrame({
    'First Column': np.random.rand(5),
    'Second Column': np.random.rand(5)
})

df_with_headers_2

   First Column  Second Column
0      0.541571       0.181773
1      0.484726       0.949622
2      0.123725       0.500863
3      0.721082       0.312581
4      0.199944       0.766961

## Index

Data Frame with custom index (rows "header")

In [7]:
df_with_renamed_index = pd.DataFrame(
    np.random.rand(5,5),
    index = ['row1', 'row2', 'row3', 'row4', 'row5']
)
df_with_renamed_index

             0         1         2         3         4
row1  0.463487  0.724165  0.046970  0.878166  0.820297
row2  0.503985  0.964979  0.382406  0.773209  0.707379
row3  0.054187  0.897049  0.436809  0.476644  0.200952
row4  0.458565  0.875422  0.539911  0.933128  0.198732
row5  0.613363  0.516657  0.788885  0.642383  0.618820

## Inspecting data frames

Checking `dtype` of columns (`dtype` is numpy class containing information about type of data)

In [8]:
df_to_inspect = pd.DataFrame(
    np.random.rand(4,4),
    columns = ['1st', '2nd', '3rd', '4th']
)
df_to_inspect
df_to_inspect.dtypes

1st    float64
2nd    float64
3rd    float64
4th    float64
dtype: object

Seeing information about index

In [9]:
df_to_inspect.index

RangeIndex(start=0, stop=4, step=1)

Seeing first n results

In [10]:
df_to_inspect.head(3)

        1st       2nd       3rd       4th
0  0.779089  0.780658  0.499278  0.618082
1  0.959674  0.880371  0.785544  0.377375
2  0.785410  0.437380  0.937946  0.781183

Seeing last n results

In [11]:
df_to_inspect.tail(3)

        1st       2nd       3rd       4th
1  0.959674  0.880371  0.785544  0.377375
2  0.785410  0.437380  0.937946  0.781183
3  0.270899  0.506259  0.089719  0.541995

Convert data to numpy array

In [12]:
df_to_inspect.to_numpy()

array([[0.77908867, 0.7806582 , 0.49927782, 0.61808229],
       [0.95967358, 0.88037148, 0.78554449, 0.3773749 ],
       [0.78540976, 0.43738037, 0.9379461 , 0.78118288],
       [0.27089885, 0.50625919, 0.08971919, 0.5419951 ]])

Quick, basic statistic analysis of columns

In [13]:
df_to_inspect.describe()

            1st       2nd       3rd       4th
count  4.000000  4.000000  4.000000  4.000000
mean   0.698768  0.651167  0.578122  0.579659
std    0.297266  0.212921  0.372939  0.167755
min    0.270899  0.437380  0.089719  0.377375
25%    0.652041  0.489039  0.396888  0.500840
50%    0.782249  0.643459  0.642411  0.580039
75%    0.828976  0.805587  0.823645  0.658857
max    0.959674  0.880371  0.937946  0.781183

# DataFrame operations

Transposing

In [14]:
df = pd.DataFrame(
    np.random.rand(6,6),
    columns = ['One', 'Two', 'Three', 'Four', 'Five', 'Six']
)
df.T

              0         1         2         3         4         5
One    0.652083  0.806605  0.183483  0.023251  0.129966  0.577197
Two    0.130538  0.709973  0.130575  0.621790  0.296192  0.833212
Three  0.372307  0.219003  0.387266  0.482263  0.886218  0.688808
Four   0.801629  0.437570  0.145590  0.438891  0.459171  0.931642
Five   0.703955  0.885576  0.162470  0.203313  0.493107  0.878054
Six    0.292953  0.988391  0.022059  0.841166  0.573567  0.327314

## Rearanging DataFrame

Sorting columns

In [15]:
df = pd.DataFrame(
    np.random.rand(6,6),
    columns = ['One', 'Two', 'Three', 'Four', 'Five', 'Six']
)
df

        One       Two     Three      Four      Five       Six
0  0.256283  0.391008  0.497091  0.970782  0.916417  0.888055
1  0.074945  0.939195  0.458979  0.348704  0.631921  0.203399
2  0.709700  0.266141  0.707394  0.762554  0.032860  0.508583
3  0.449035  0.236639  0.215627  0.664697  0.092521  0.417431
4  0.650439  0.840527  0.425056  0.398808  0.709039  0.809138
5  0.186220  0.491463  0.690640  0.059098  0.156114  0.238808

In [16]:
df.sort_index(axis=1, ascending=False)

        Two     Three       Six       One      Four      Five
0  0.391008  0.497091  0.888055  0.256283  0.970782  0.916417
1  0.939195  0.458979  0.203399  0.074945  0.348704  0.631921
2  0.266141  0.707394  0.508583  0.709700  0.762554  0.032860
3  0.236639  0.215627  0.417431  0.449035  0.664697  0.092521
4  0.840527  0.425056  0.809138  0.650439  0.398808  0.709039
5  0.491463  0.690640  0.238808  0.186220  0.059098  0.156114

Sorting by values in column

In [17]:
df.sort_values(by='Three')

        One       Two     Three      Four      Five       Six
3  0.449035  0.236639  0.215627  0.664697  0.092521  0.417431
4  0.650439  0.840527  0.425056  0.398808  0.709039  0.809138
1  0.074945  0.939195  0.458979  0.348704  0.631921  0.203399
0  0.256283  0.391008  0.497091  0.970782  0.916417  0.888055
5  0.186220  0.491463  0.690640  0.059098  0.156114  0.238808
2  0.709700  0.266141  0.707394  0.762554  0.032860  0.508583

# Selection of data

Select column by label

In [18]:
df_selection = pd.DataFrame(
    np.random.rand(6,6),
    columns = ['One', 'Two', 'Three', 'Four', 'Five', 'Six']
)

df_selection['Two']

0    0.079875
1    0.176477
2    0.868086
3    0.004336
4    0.568761
5    0.269324
Name: Two, dtype: float64

Select rows by index

In [26]:
df_selection[0:1]

        One       Two     Three      Four      Five       Six
0  0.565142  0.079875  0.054353  0.064401  0.156411  0.120719

Selection of rows and columns

In [33]:
df_selection.loc[1:2,['Two']]

        Two
1  0.176477
2  0.868086

Select scalar

In [34]:
df_selection.loc[1:1,['Three']]

      Three
1  0.542919

Select row by position

In [40]:
df_selection.iloc[2]

One      0.680494
Two      0.868086
Three    0.644983
Four     0.067016
Five     0.136073
Six      0.819536
Name: 2, dtype: float64

Select rows and columns by position

In [45]:
df_selection.iloc[1:3,2:4]

      Three      Four
1  0.542919  0.337789
2  0.644983  0.067016

Select exact rows and columns

In [47]:
df_selection.iloc[[1,2,5], [2,4]]

      Three      Five
1  0.542919  0.863307
2  0.644983  0.136073
5  0.574959  0.118598

Getting Scalar by position

In [49]:
df_selection.iloc[1,2]

0.5429190875113665

In [50]:
df_selection.iat[1,2]

0.5429190875113665

Select row with predicate

In [51]:
df_selection[df_selection.Two > 0.2]

        One       Two     Three      Four      Five       Six
2  0.680494  0.868086  0.644983  0.067016  0.136073  0.819536
4  0.945049  0.568761  0.719975  0.747343  0.467276  0.135412
5  0.359462  0.269324  0.574959  0.356188  0.118598  0.818675

Select values with predicate

In [52]:
df_selection[df_selection > 0.2]

        One       Two     Three      Four      Five       Six
0  0.565142       NaN       NaN       NaN       NaN       NaN
1  0.263395       NaN  0.542919  0.337789  0.863307  0.808493
2  0.680494  0.868086  0.644983       NaN       NaN  0.819536
3       NaN       NaN       NaN  0.276954  0.786233       NaN
4  0.945049  0.568761  0.719975  0.747343  0.467276       NaN
5  0.359462  0.269324  0.574959  0.356188       NaN  0.818675

## Setting

In [56]:
df_setting = pd.DataFrame(
    np.random.rand(7,7),
    columns = ['One', 'Two', 'Three', 'Four', 'Five', 'Six', 'Seven']
)

Setting scalar

In [58]:
df_setting.iat[0,1]=10
df_setting

        One        Two     Three      Four      Five       Six     Seven
0  0.218735  10.000000  0.986230  0.179264  0.564069  0.704190  0.623944
1  0.601049   0.988513  0.828970  0.130524  0.798819  0.523432  0.582677
2  0.698289   0.125353  0.210183  0.398378  0.426583  0.731135  0.204089
3  0.891096   0.024808  0.624441  0.867067  0.594034  0.723214  0.798750
4  0.986074   0.944895  0.176993  0.567683  0.352229  0.556713  0.894051
5  0.558890   0.856369  0.742252  0.403126  0.629937  0.168222  0.878462
6  0.278299   0.612663  0.311719  0.418752  0.104500  0.584859  0.278860

Setting column

In [66]:
df_setting.loc[:, 'Four'] = np.array([17] * len(df_setting))
df_setting

        One        Two     Three  Four      Five       Six     Seven
0 -0.218735 -10.000000 -0.986230    17 -0.564069 -0.704190 -0.623944
1 -0.601049  -0.988513 -0.828970    17 -0.798819 -0.523432 -0.582677
2 -0.698289   0.125353 -0.210183    17 -0.426583 -0.731135 -0.204089
3 -0.891096   0.024808 -0.624441    17 -0.594034 -0.723214 -0.798750
4 -0.986074  -0.944895  0.176993    17 -0.352229 -0.556713 -0.894051
5 -0.558890  -0.856369 -0.742252    17 -0.629937  0.168222 -0.878462
6 -0.278299  -0.612663 -0.311719    17  0.104500 -0.584859 -0.278860

Setting with predicate

In [64]:
df_setting[df_setting > 0.2] = -df_setting
df_setting

        One        Two     Three  Four      Five       Six     Seven
0 -0.218735 -10.000000 -0.986230   -17 -0.564069 -0.704190 -0.623944
1 -0.601049  -0.988513 -0.828970   -17 -0.798819 -0.523432 -0.582677
2 -0.698289   0.125353 -0.210183   -17 -0.426583 -0.731135 -0.204089
3 -0.891096   0.024808 -0.624441   -17 -0.594034 -0.723214 -0.798750
4 -0.986074  -0.944895  0.176993   -17 -0.352229 -0.556713 -0.894051
5 -0.558890  -0.856369 -0.742252   -17 -0.629937  0.168222 -0.878462
6 -0.278299  -0.612663 -0.311719   -17  0.104500 -0.584859 -0.278860

In [74]:
df_setting2 = df_setting.reindex(columns=list(df.columns) + ['Eight'])
df_setting2

        One        Two     Three  Four      Five       Six  Eight
0 -0.218735 -10.000000 -0.986230    17 -0.564069 -0.704190    NaN
1 -0.601049  -0.988513 -0.828970    17 -0.798819 -0.523432    NaN
2 -0.698289   0.125353 -0.210183    17 -0.426583 -0.731135    NaN
3 -0.891096   0.024808 -0.624441    17 -0.594034 -0.723214    NaN
4 -0.986074  -0.944895  0.176993    17 -0.352229 -0.556713    NaN
5 -0.558890  -0.856369 -0.742252    17 -0.629937  0.168222    NaN
6 -0.278299  -0.612663 -0.311719    17  0.104500 -0.584859    NaN

Drop all rows with Nan

In [75]:
df_setting2.dropna(how='any')

Empty DataFrame
Columns: [One, Two, Three, Four, Five, Six, Eight]
Index: []

Fill nan

In [77]:
df_setting2.fillna(value=5)

        One        Two     Three  Four      Five       Six  Eight
0 -0.218735 -10.000000 -0.986230    17 -0.564069 -0.704190    5.0
1 -0.601049  -0.988513 -0.828970    17 -0.798819 -0.523432    5.0
2 -0.698289   0.125353 -0.210183    17 -0.426583 -0.731135    5.0
3 -0.891096   0.024808 -0.624441    17 -0.594034 -0.723214    5.0
4 -0.986074  -0.944895  0.176993    17 -0.352229 -0.556713    5.0
5 -0.558890  -0.856369 -0.742252    17 -0.629937  0.168222    5.0
6 -0.278299  -0.612663 -0.311719    17  0.104500 -0.584859    5.0

In [78]:
pd.isna(df_setting2)

     One    Two  Three   Four   Five    Six  Eight
0  False  False  False  False  False  False   True
1  False  False  False  False  False  False   True
2  False  False  False  False  False  False   True
3  False  False  False  False  False  False   True
4  False  False  False  False  False  False   True
5  False  False  False  False  False  False   True
6  False  False  False  False  False  False   True

## Operations

In [81]:
df_operations = pd.DataFrame(
    np.random.rand(4,4),
    columns = ['One', 'Two', 'Three', 'Four']
)

mean of each column

In [83]:
df_operations.mean()

One      0.385418
Two      0.417936
Three    0.467142
Four     0.471253
dtype: float64

mean of each row

In [84]:
df_operations.mean(1)

0    0.461650
1    0.601774
2    0.257889
3    0.420437
dtype: float64

Apply function to the data

In [87]:
df_operations.apply(lambda x: x + 100)

          One         Two       Three        Four
0  100.071985  100.677806  100.509649  100.587159
1  100.205418  100.879626  100.713914  100.608137
2  100.888062  100.092833  100.048022  100.002639
3  100.376206  100.021480  100.596983  100.687077

Histogram

In [91]:
df_operations['Two'].value_counts()

0.677806    1
0.021480    1
0.879626    1
0.092833    1
Name: Two, dtype: int64